; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=38, out_folder=htg/blocksworld/training, instance_id=18, seed=2042, goal_proportion=0.1

(define (problem blocksworld-18)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b4)
    (on b4 b21)
    (on b21 b34)
    (on b34 b13)
    (on b13 b6)
    (on b6 b32)
    (on b32 b18)
    (on b18 b19)
    (on b19 b36)
    (on b36 b25)
    (on b25 b26)
    (on b26 b31)
    (on b31 b2)
    (on b2 b24)
    (on b24 b5)
    (on b5 b35)
    (on b35 b14)
    (on b14 b9)
    (on b9 b28)
    (on b28 b12)
    (on b12 b38)
    (on b38 b17)
    (on b17 b37)
    (on b37 b16)
    (on b16 b8)
    (on b8 b3)
    (on b3 b30)
    (on b30 b23)
    (on b23 b29)
    (on b29 b1)
    (on b1 b27)
    (on b27 b7)
    (on b7 b20)
    (on b20 b10)
    (on b10 b33)
    (on b33 b15)
    (on b15 b22)
    (on-table b22))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b11 b4)
   deleted: (on b11 b4) (clear b11) (arm-empty)
   added: (holding b11) (clear b4)
   goals met: 0 of 4
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 4
3. (unstack b4 b21)
   deleted: (on b4 b21) (clear b4) (arm-empty)
   added: (holding b4) (clear b21)
   goals met: 0 of 4
4. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 4
5. (unstack b21 b34)
   deleted: (on b21 b34) (clear b21) (arm-empty)
   added: (holding b21) (clear b34)
   goals met: 0 of 4
6. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 4
7. (unstack b34 b13)
   deleted: (on b34 b13) (clear b34) (arm-empty)
   added: (holding b34) (clear b13)
   goals met: 0 of 4
8. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 0 of 4
9. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 0 of 4
10. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 4
11. (unstack b6 b32)
   deleted: (on b6 b32) (clear b6) (arm-empty)
   added: (holding b6) (clear b32)
   goals met: 0 of 4
12. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 4
13. (unstack b32 b18)
   deleted: (on b32 b18) (clear b32) (arm-empty)
   added: (holding b32) (clear b18)
   goals met: 0 of 4
14. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 0 of 4
15. (unstack b18 b19)
   deleted: (on b18 b19) (clear b18) (arm-empty)
   added: (holding b18) (clear b19)
   goals met: 0 of 4
16. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 4
17. (unstack b19 b36)
   deleted: (on b19 b36) (clear b19) (arm-empty)
   added: (holding b19) (clear b36)
   goals met: 0 of 4
18. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 4
19. (unstack b36 b25)
   deleted: (on b36 b25) (clear b36) (arm-empty)
   added: (holding b36) (clear b25)
   goals met: 0 of 4
20. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 0 of 4
21. (unstack b25 b26)
   deleted: (on b25 b26) (clear b25) (arm-empty)
   added: (holding b25) (clear b26)
   goals met: 0 of 4
22. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 4
23. (unstack b26 b31)
   deleted: (on b26 b31) (clear b26) (arm-empty)
   added: (holding b26) (clear b31)
   goals met: 0 of 4
24. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 0 of 4
25. (unstack b31 b2)
   deleted: (on b31 b2) (clear b31) (arm-empty)
   added: (holding b31) (clear b2)
   goals met: 0 of 4
26. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 0 of 4
27. (unstack b2 b24)
   deleted: (on b2 b24) (clear b2) (arm-empty)
   added: (holding b2) (clear b24)
   goals met: 0 of 4
28. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 4
29. (unstack b24 b5)
   deleted: (on b24 b5) (clear b24) (arm-empty)
   added: (holding b24) (clear b5)
   goals met: 0 of 4
30. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 4
31. (unstack b5 b35)
   deleted: (on b5 b35) (clear b5) (arm-empty)
   added: (holding b5) (clear b35)
   goals met: 0 of 4
32. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 4
33. (unstack b35 b14)
   deleted: (on b35 b14) (clear b35) (arm-empty)
   added: (holding b35) (clear b14)
   goals met: 0 of 4
34. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 0 of 4
35. (unstack b14 b9)
   deleted: (on b14 b9) (clear b14) (arm-empty)
   added: (holding b14) (clear b9)
   goals met: 0 of 4
36. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 4
37. (unstack b9 b28)
   deleted: (on b9 b28) (clear b9) (arm-empty)
   added: (holding b9) (clear b28)
   goals met: 0 of 4
38. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 4
39. (unstack b28 b12)
   deleted: (on b28 b12) (clear b28) (arm-empty)
   added: (holding b28) (clear b12)
   goals met: 0 of 4
40. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 0 of 4
41. (unstack b12 b38)
   deleted: (on b12 b38) (clear b12) (arm-empty)
   added: (holding b12) (clear b38)
   goals met: 0 of 4
42. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 4
43. (unstack b38 b17)
   deleted: (on b38 b17) (clear b38) (arm-empty)
   added: (holding b38) (clear b17)
   goals met: 0 of 4
44. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 0 of 4
45. (unstack b17 b37)
   deleted: (on b17 b37) (clear b17) (arm-empty)
   added: (holding b17) (clear b37)
   goals met: 0 of 4
46. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 4
47. (unstack b37 b16)
   deleted: (on b37 b16) (clear b37) (arm-empty)
   added: (holding b37) (clear b16)
   goals met: 0 of 4
48. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 0 of 4
49. (unstack b16 b8)
   deleted: (on b16 b8) (clear b16) (arm-empty)
   added: (holding b16) (clear b8)
   goals met: 0 of 4
50. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 4
51. (unstack b8 b3)
   deleted: (on b8 b3) (clear b8) (arm-empty)
   added: (holding b8) (clear b3)
   goals met: 0 of 4
52. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 4
53. (unstack b3 b30)
   deleted: (on b3 b30) (clear b3) (arm-empty)
   added: (holding b3) (clear b30)
   goals met: 0 of 4
54. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 4
55. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 1 of 4
56. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 2 of 4
57. (unstack b30 b23)
   deleted: (on b30 b23) (clear b30) (arm-empty)
   added: (holding b30) (clear b23)
   goals met: 2 of 4
58. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 2 of 4
59. (unstack b23 b29)
   deleted: (on b23 b29) (clear b23) (arm-empty)
   added: (holding b23) (clear b29)
   goals met: 2 of 4
60. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 2 of 4
61. (unstack b29 b1)
   deleted: (on b29 b1) (clear b29) (arm-empty)
   added: (holding b29) (clear b1)
   goals met: 3 of 4
62. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 3 of 4
63. (unstack b1 b27)
   deleted: (on b1 b27) (clear b1) (arm-empty)
   added: (holding b1) (clear b27)
   goals met: 2 of 4
64. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 4 of 4
